<details>
<summary>Full deployment using Terraform and Ansible is successful.</summary>



```
root@XXXXXXXXXXXXXXXXXXXXXx:~/projects/enthalpy/terraform# terraform apply -var-file="nocommit/staging.tfvars"
data.template_file.userdata-yaml: Reading...
data.template_file.userdata-yaml: Read complete after 0s [id=2c65d4011ffc776138b65981a84ac95902b73e20ba5227f5ef12ef73eda33b68]
data.hcloud_ssh_keys.all_keys: Reading...
data.template_cloudinit_config.userdata-yaml: Reading...
data.hcloud_firewall.firewall-1: Reading...
data.template_cloudinit_config.userdata-yaml: Read complete after 0s [id=991287536]
data.hcloud_firewall.firewall-1: Read complete after 0s [name=firewall-1]
data.hcloud_ssh_keys.all_keys: Read complete after 0s [id=7940868]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # hcloud_network.network will be created
  + resource "hcloud_network" "network" {
      + delete_protection = false
      + id                = (known after apply)
      + ip_range          = "10.0.199.0/24"
      + name              = "hz-private-01"
    }

  # hcloud_network_subnet.network-subnet will be created
  + resource "hcloud_network_subnet" "network-subnet" {
      + gateway      = (known after apply)
      + id           = (known after apply)
      + ip_range     = "10.0.199.0/24"
      + network_id   = (known after apply)
      + network_zone = "eu-central"
      + type         = "cloud"
    }

  # hcloud_server.avogadro will be created
  + resource "hcloud_server" "avogadro" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = [
          + 521754,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + location                   = "nbg1"
      + name                       = "avogadro"
      + rebuild_protection         = false
      + server_type                = "cx11"
      + ssh_keys                   = [
          + "root@avaya-metrics",
        ]
      + status                     = (known after apply)
      + user_data                  = "THE/3P4XJqH/J/vbrmbGVsp1hUU="

      + network {
          + alias_ips   = []
          + ip          = "10.0.199.100"
          + mac_address = (known after apply)
          + network_id  = (known after apply)
        }
    }

  # hcloud_volume.avogadro_datadisk_01 will be created
  + resource "hcloud_volume" "avogadro_datadisk_01" {
      + automount         = false
      + delete_protection = false
      + format            = "ext4"
      + id                = (known after apply)
      + linux_device      = (known after apply)
      + location          = (known after apply)
      + name              = "avogadro_datadisk_01"
      + server_id         = (known after apply)
      + size              = 10
    }

  # local_file.AnsibleInventory will be created
  + resource "local_file" "AnsibleInventory" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../ansible/host_vars/avogadro.yaml"
      + id                   = (known after apply)
    }

  # null_resource.avogadro-ready will be created
  + resource "null_resource" "avogadro-ready" {
      + id = (known after apply)
    }

  # time_sleep.wait_180_seconds will be created
  + resource "time_sleep" "wait_180_seconds" {
      + create_duration = "180s"
      + id              = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

hcloud_network.network: Creating...
hcloud_network.network: Creation complete after 1s [id=2066372]
hcloud_network_subnet.network-subnet: Creating...
hcloud_network_subnet.network-subnet: Creation complete after 2s [id=2066372-10.0.199.0/24]
hcloud_server.avogadro: Creating...
hcloud_server.avogadro: Still creating... [10s elapsed]
hcloud_server.avogadro: Creation complete after 19s [id=24259001]
hcloud_volume.avogadro_datadisk_01: Creating...
hcloud_volume.avogadro_datadisk_01: Creation complete after 6s [id=23277327]
local_file.AnsibleInventory: Creating...
local_file.AnsibleInventory: Creation complete after 0s [id=7b5fbe914e4a0cdb34f8ca717b5895053beb9310]
time_sleep.wait_180_seconds: Creating...
time_sleep.wait_180_seconds: Still creating... [10s elapsed]
time_sleep.wait_180_seconds: Still creating... [20s elapsed]
time_sleep.wait_180_seconds: Still creating... [30s elapsed]
time_sleep.wait_180_seconds: Still creating... [40s elapsed]
time_sleep.wait_180_seconds: Still creating... [50s elapsed]
time_sleep.wait_180_seconds: Still creating... [1m0s elapsed]
time_sleep.wait_180_seconds: Still creating... [1m10s elapsed]
time_sleep.wait_180_seconds: Still creating... [1m20s elapsed]
time_sleep.wait_180_seconds: Still creating... [1m30s elapsed]
time_sleep.wait_180_seconds: Still creating... [1m40s elapsed]
time_sleep.wait_180_seconds: Still creating... [1m50s elapsed]
time_sleep.wait_180_seconds: Still creating... [2m0s elapsed]
time_sleep.wait_180_seconds: Still creating... [2m10s elapsed]
time_sleep.wait_180_seconds: Still creating... [2m20s elapsed]
time_sleep.wait_180_seconds: Still creating... [2m30s elapsed]
time_sleep.wait_180_seconds: Still creating... [2m40s elapsed]
time_sleep.wait_180_seconds: Still creating... [2m50s elapsed]
time_sleep.wait_180_seconds: Still creating... [3m0s elapsed]
time_sleep.wait_180_seconds: Creation complete after 3m0s [id=2022-09-28T20:58:32Z]
null_resource.avogadro-ready: Creating...
null_resource.avogadro-ready: Provisioning with 'local-exec'...
null_resource.avogadro-ready (local-exec): Executing: ["/bin/sh" "-c" "ansible-playbook ../ansible/tasks/main.yaml -i ../ansible/inventory.yaml --vault-password-file ../ansible/nocommit/vaultpass"]
null_resource.avogadro-ready (local-exec): [WARNING]: Found both group and host with same name: avogadro

null_resource.avogadro-ready (local-exec): PLAY [avogadro] ****************************************************************

null_resource.avogadro-ready (local-exec): TASK [Gathering Facts] *********************************************************
null_resource.avogadro-ready: Still creating... [10s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Set hostname] ************************************************************
null_resource.avogadro-ready: Still creating... [20s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro]

null_resource.avogadro-ready (local-exec): PLAY [avogadro] ****************************************************************

null_resource.avogadro-ready (local-exec): TASK [Gathering Facts] *********************************************************
null_resource.avogadro-ready: Still creating... [30s elapsed]
null_resource.avogadro-ready: Still creating... [40s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Set IPV4 Forwarding] *****************************************************
null_resource.avogadro-ready: Still creating... [50s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): PLAY [avogadro] ****************************************************************

null_resource.avogadro-ready (local-exec): TASK [Gathering Facts] *********************************************************
null_resource.avogadro-ready: Still creating... [1m0s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create a ext4 filesystem on data disk "/dev/disk/by-id/scsi-0HC_Volume_23277327"] ***
null_resource.avogadro-ready: Still creating... [1m10s elapsed]
null_resource.avogadro-ready: Still creating... [1m20s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Mount datadisk by fspath] ************************************************
null_resource.avogadro-ready: Still creating... [1m30s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): PLAY [avogadro] ****************************************************************

null_resource.avogadro-ready (local-exec): TASK [Gathering Facts] *********************************************************
null_resource.avogadro-ready: Still creating... [1m40s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Force cache update] ******************************************************
null_resource.avogadro-ready: Still creating... [1m50s elapsed]
null_resource.avogadro-ready: Still creating... [2m0s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Install default packages] ************************************************
null_resource.avogadro-ready: Still creating... [2m10s elapsed]
null_resource.avogadro-ready: Still creating... [2m20s elapsed]
null_resource.avogadro-ready: Still creating... [2m30s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Install custom packages for avogadro group] ******************************
null_resource.avogadro-ready: Still creating... [2m40s elapsed]
null_resource.avogadro-ready: Still creating... [2m50s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): PLAY [avogadro] ****************************************************************

null_resource.avogadro-ready (local-exec): TASK [Gathering Facts] *********************************************************
null_resource.avogadro-ready: Still creating... [3m0s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create monitoring service account] ***************************************
null_resource.avogadro-ready: Still creating... [3m10s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create ansible service account] ******************************************
null_resource.avogadro-ready: Still creating... [3m20s elapsed]
null_resource.avogadro-ready: Still creating... [3m30s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): PLAY [avogadro] ****************************************************************

null_resource.avogadro-ready (local-exec): TASK [Gathering Facts] *********************************************************
null_resource.avogadro-ready: Still creating... [3m40s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Install required system packages] ****************************************
null_resource.avogadro-ready: Still creating... [3m50s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro] => (item=apt-transport-https)
null_resource.avogadro-ready: Still creating... [4m0s elapsed]
null_resource.avogadro-ready: Still creating... [4m10s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro] => (item=ca-certificates)
null_resource.avogadro-ready: Still creating... [4m20s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro] => (item=curl)
null_resource.avogadro-ready: Still creating... [4m30s elapsed]
null_resource.avogadro-ready: Still creating... [4m40s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro] => (item=software-properties-common)
null_resource.avogadro-ready: Still creating... [4m50s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro] => (item=python3-pip)
null_resource.avogadro-ready: Still creating... [5m0s elapsed]
null_resource.avogadro-ready: Still creating... [5m10s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro] => (item=virtualenv)
null_resource.avogadro-ready: Still creating... [5m20s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro] => (item=python3-setuptools)

null_resource.avogadro-ready (local-exec): TASK [Add Docker GPG apt Key] **************************************************
null_resource.avogadro-ready: Still creating... [5m30s elapsed]
null_resource.avogadro-ready: Still creating... [5m40s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Add Docker Repository] ***************************************************
null_resource.avogadro-ready: Still creating... [5m50s elapsed]
null_resource.avogadro-ready: Still creating... [6m0s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Update apt and install docker-ce] ****************************************
null_resource.avogadro-ready: Still creating... [6m10s elapsed]
null_resource.avogadro-ready: Still creating... [6m20s elapsed]
null_resource.avogadro-ready: Still creating... [6m30s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro] => (item=docker-ce)
null_resource.avogadro-ready: Still creating... [6m40s elapsed]
null_resource.avogadro-ready: Still creating... [6m50s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro] => (item=docker-ce-cli)
null_resource.avogadro-ready: Still creating... [7m0s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro] => (item=containerd.io)
null_resource.avogadro-ready: Still creating... [7m10s elapsed]
null_resource.avogadro-ready: Still creating... [7m20s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro] => (item=docker-compose-plugin)

null_resource.avogadro-ready (local-exec): TASK [Install Docker Module for Python] ****************************************
null_resource.avogadro-ready: Still creating... [7m30s elapsed]
null_resource.avogadro-ready: Still creating... [7m40s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Add "apigban" to docker group] *******************************************
null_resource.avogadro-ready: Still creating... [7m50s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): PLAY [avogadro] ****************************************************************

null_resource.avogadro-ready (local-exec): TASK [Gathering Facts] *********************************************************
null_resource.avogadro-ready: Still creating... [8m0s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create custom directory for docker] **************************************
null_resource.avogadro-ready: Still creating... [8m10s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create custom directory for docker] **************************************
null_resource.avogadro-ready: Still creating... [8m20s elapsed]
null_resource.avogadro-ready: Still creating... [8m30s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [install docker daemon configuration file from template] ******************
null_resource.avogadro-ready: Still creating... [8m40s elapsed]
null_resource.avogadro-ready: Still creating... [8m50s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [install docker logging configuration files from template] ****************
null_resource.avogadro-ready: Still creating... [9m0s elapsed]
null_resource.avogadro-ready: Still creating... [9m10s elapsed]
null_resource.avogadro-ready: Still creating... [9m20s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [install docker logrotate files from template] ****************************
null_resource.avogadro-ready: Still creating... [9m30s elapsed]
null_resource.avogadro-ready: Still creating... [9m40s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Ensure docker daemon is restarted] ***************************************
null_resource.avogadro-ready: Still creating... [9m50s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): PLAY [avogadro] ****************************************************************

null_resource.avogadro-ready (local-exec): TASK [Gathering Facts] *********************************************************
null_resource.avogadro-ready: Still creating... [10m0s elapsed]
null_resource.avogadro-ready: Still creating... [10m10s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create network] **********************************************************
null_resource.avogadro-ready: Still creating... [10m20s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create network] **********************************************************
null_resource.avogadro-ready: Still creating... [10m30s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): PLAY [avogadro] ****************************************************************

null_resource.avogadro-ready (local-exec): TASK [Gathering Facts] *********************************************************
null_resource.avogadro-ready: Still creating... [10m40s elapsed]
null_resource.avogadro-ready: Still creating... [10m50s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Remove Default Fail2ban config file] *************************************
null_resource.avogadro-ready: Still creating... [11m0s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Copy default jail.local to /etc/fail2ban] ********************************
null_resource.avogadro-ready: Still creating... [11m10s elapsed]
null_resource.avogadro-ready: Still creating... [11m20s elapsed]
null_resource.avogadro-ready: Still creating... [11m30s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Copy jail files to fail2ban.conf_path] ***********************************
null_resource.avogadro-ready: Still creating... [11m40s elapsed]
null_resource.avogadro-ready: Still creating... [11m50s elapsed]
null_resource.avogadro-ready: Still creating... [12m0s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro] => (item=/root/projects/enthalpy/ansible/tasks/app/fail2ban/files/jails/sshd_jail.conf)

null_resource.avogadro-ready (local-exec): TASK [Restart sshd service] ****************************************************
null_resource.avogadro-ready: Still creating... [12m10s elapsed]
null_resource.avogadro-ready: Still creating... [12m20s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): PLAY [avogadro] ****************************************************************

null_resource.avogadro-ready (local-exec): TASK [Gathering Facts] *********************************************************
null_resource.avogadro-ready: Still creating... [12m30s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create a volume] *********************************************************
null_resource.avogadro-ready: Still creating... [12m40s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Start portainer, connect to network] *************************************
null_resource.avogadro-ready: Still creating... [12m50s elapsed]
null_resource.avogadro-ready: Still creating... [13m0s elapsed]
null_resource.avogadro-ready: Still creating... [13m10s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): PLAY [avogadro] ****************************************************************

null_resource.avogadro-ready (local-exec): TASK [Create headscale container volume] ***************************************
null_resource.avogadro-ready: Still creating... [13m20s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Prepare a directory, used to hold headscale configuration and the SQLite database] ***
null_resource.avogadro-ready: Still creating... [13m30s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Prepare a directory, used to hold headscale data] ************************
null_resource.avogadro-ready: Still creating... [13m40s elapsed]
null_resource.avogadro-ready: Still creating... [13m50s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create an empty sqlite3 DB file] *****************************************
null_resource.avogadro-ready: Still creating... [14m0s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [render headscale config from template] ***********************************
null_resource.avogadro-ready: Still creating... [14m10s elapsed]
null_resource.avogadro-ready: Still creating... [14m20s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create a build directory if it does not exist] ***************************
null_resource.avogadro-ready: Still creating... [14m30s elapsed]
null_resource.avogadro-ready: Still creating... [14m40s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Download headscale src] **************************************************
null_resource.avogadro-ready: Still creating... [14m50s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Build a headscale image] *************************************************
null_resource.avogadro-ready: Still creating... [15m0s elapsed]
null_resource.avogadro-ready: Still creating... [15m10s elapsed]
null_resource.avogadro-ready: Still creating... [15m20s elapsed]
null_resource.avogadro-ready: Still creating... [15m30s elapsed]
null_resource.avogadro-ready: Still creating... [15m40s elapsed]
null_resource.avogadro-ready: Still creating... [15m50s elapsed]
null_resource.avogadro-ready: Still creating... [16m0s elapsed]
null_resource.avogadro-ready: Still creating... [16m10s elapsed]
null_resource.avogadro-ready: Still creating... [16m20s elapsed]
null_resource.avogadro-ready: Still creating... [16m30s elapsed]
null_resource.avogadro-ready: Still creating... [16m40s elapsed]
null_resource.avogadro-ready: Still creating... [16m50s elapsed]
null_resource.avogadro-ready: Still creating... [17m0s elapsed]
null_resource.avogadro-ready: Still creating... [17m10s elapsed]
null_resource.avogadro-ready: Still creating... [17m20s elapsed]
null_resource.avogadro-ready: Still creating... [17m30s elapsed]
null_resource.avogadro-ready: Still creating... [17m40s elapsed]
null_resource.avogadro-ready: Still creating... [17m50s elapsed]
null_resource.avogadro-ready: Still creating... [18m0s elapsed]
null_resource.avogadro-ready: Still creating... [18m10s elapsed]
null_resource.avogadro-ready: Still creating... [18m20s elapsed]
null_resource.avogadro-ready: Still creating... [18m30s elapsed]
null_resource.avogadro-ready: Still creating... [18m40s elapsed]
null_resource.avogadro-ready: Still creating... [18m50s elapsed]
null_resource.avogadro-ready: Still creating... [19m0s elapsed]
null_resource.avogadro-ready: Still creating... [19m10s elapsed]
null_resource.avogadro-ready: Still creating... [19m20s elapsed]
null_resource.avogadro-ready: Still creating... [19m30s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Start container, connect to network and link] ****************************
null_resource.avogadro-ready: Still creating... [19m40s elapsed]
null_resource.avogadro-ready: Still creating... [19m50s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create a VPN namespace] **************************************************
null_resource.avogadro-ready: Still creating... [20m0s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): PLAY [avogadro] ****************************************************************

null_resource.avogadro-ready (local-exec): TASK [Deploy headscale-ui] *****************************************************
null_resource.avogadro-ready: Still creating... [20m10s elapsed]
null_resource.avogadro-ready: Still creating... [20m20s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): PLAY [avogadro] ****************************************************************

null_resource.avogadro-ready (local-exec): TASK [Gathering Facts] *********************************************************
null_resource.avogadro-ready: Still creating... [20m30s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create caddy data volume] ************************************************
null_resource.avogadro-ready: Still creating... [20m40s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create caddy config volume] **********************************************
null_resource.avogadro-ready: Still creating... [20m50s elapsed]
null_resource.avogadro-ready: Still creating... [21m0s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Render Caddyfile from template] ******************************************
null_resource.avogadro-ready: Still creating... [21m10s elapsed]
null_resource.avogadro-ready: Still creating... [21m20s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Deploy caddy] ************************************************************
null_resource.avogadro-ready: Still creating... [21m30s elapsed]
null_resource.avogadro-ready: Still creating... [21m40s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Prepare network tshooting container image] *******************************
null_resource.avogadro-ready: Still creating... [21m50s elapsed]
null_resource.avogadro-ready: Still creating... [22m0s elapsed]
null_resource.avogadro-ready: Still creating... [22m10s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): PLAY [avogadro] ****************************************************************

null_resource.avogadro-ready (local-exec): TASK [Gathering Facts] *********************************************************
null_resource.avogadro-ready: Still creating... [22m20s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create authentik data volume] ********************************************
null_resource.avogadro-ready: Still creating... [22m30s elapsed]
null_resource.avogadro-ready: Still creating... [22m40s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create cache data volume] ************************************************
null_resource.avogadro-ready: Still creating... [22m50s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create authentik server media volume] ************************************
null_resource.avogadro-ready: Still creating... [23m0s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create authentik server template volume] *********************************
null_resource.avogadro-ready: Still creating... [23m10s elapsed]
null_resource.avogadro-ready: Still creating... [23m20s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create authentik server geoip volume] ************************************
null_resource.avogadro-ready: Still creating... [23m30s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create authentik server certs volume] ************************************
null_resource.avogadro-ready: Still creating... [23m40s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create database, connect to network] *************************************
null_resource.avogadro-ready: Still creating... [23m50s elapsed]
null_resource.avogadro-ready: Still creating... [24m0s elapsed]
null_resource.avogadro-ready: Still creating... [24m10s elapsed]
null_resource.avogadro-ready (local-exec): [WARNING]: Docker warning: Your kernel does not support swap limit capabilities
null_resource.avogadro-ready (local-exec): or the cgroup is not mounted. Memory limited without swap.
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create cache, connect to network] ****************************************
null_resource.avogadro-ready: Still creating... [24m20s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create authentik-server, connect to network] *****************************
null_resource.avogadro-ready: Still creating... [24m30s elapsed]
null_resource.avogadro-ready: Still creating... [24m40s elapsed]
null_resource.avogadro-ready: Still creating... [24m50s elapsed]
null_resource.avogadro-ready: Still creating... [25m0s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create authentik-worker, connect to network] *****************************
null_resource.avogadro-ready: Still creating... [25m10s elapsed]
null_resource.avogadro-ready: Still creating... [25m20s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create geoipupdate container, connect to network] ************************
null_resource.avogadro-ready: Still creating... [25m30s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): PLAY [avogadro] ****************************************************************

null_resource.avogadro-ready (local-exec): TASK [Gathering Facts] *********************************************************
null_resource.avogadro-ready: Still creating... [25m40s elapsed]
null_resource.avogadro-ready: Still creating... [25m50s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Download file node_exporter-1.3.1.linux-amd64.tar.gz (sha256)] ***********
null_resource.avogadro-ready: Still creating... [26m0s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Extract nodeexporter archive] ********************************************
null_resource.avogadro-ready: Still creating... [26m10s elapsed]
null_resource.avogadro-ready: Still creating... [26m20s elapsed]
null_resource.avogadro-ready: Still creating... [26m30s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Copy node_exporter binary to /usr/bin/node_exporter] *********************
null_resource.avogadro-ready: Still creating... [26m40s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Render node_exporter.service unit file from template] ********************
null_resource.avogadro-ready: Still creating... [26m50s elapsed]
null_resource.avogadro-ready: Still creating... [27m0s elapsed]
null_resource.avogadro-ready: Still creating... [27m10s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Enable and start node_exporter.service] **********************************
null_resource.avogadro-ready: Still creating... [27m20s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): PLAY [avogadro] ****************************************************************

null_resource.avogadro-ready (local-exec): TASK [Gathering Facts] *********************************************************
null_resource.avogadro-ready: Still creating... [27m30s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create prometheus config volume] *****************************************
null_resource.avogadro-ready: Still creating... [27m40s elapsed]
null_resource.avogadro-ready: Still creating... [27m50s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create prometheus config volume] *****************************************
null_resource.avogadro-ready: Still creating... [28m0s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Render prometheus configuration from template] ***************************
null_resource.avogadro-ready: Still creating... [28m10s elapsed]
null_resource.avogadro-ready: Still creating... [28m20s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create cadvisor container, connect to network] ***************************
null_resource.avogadro-ready: Still creating... [28m30s elapsed]
null_resource.avogadro-ready: Still creating... [28m40s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create prometheus container] *********************************************
null_resource.avogadro-ready: Still creating... [28m50s elapsed]
null_resource.avogadro-ready: Still creating... [29m0s elapsed]
null_resource.avogadro-ready: Still creating... [29m10s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): PLAY [avogadro] ****************************************************************

null_resource.avogadro-ready (local-exec): TASK [Gathering Facts] *********************************************************
null_resource.avogadro-ready: Still creating... [29m20s elapsed]
null_resource.avogadro-ready (local-exec): ok: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Ensure unzip is installed.] **********************************************
null_resource.avogadro-ready: Still creating... [29m30s elapsed]
null_resource.avogadro-ready: Still creating... [29m40s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Download Grafana Agent binary] *******************************************
null_resource.avogadro-ready: Still creating... [29m50s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Unarchive Grafana Agent binary] ******************************************
null_resource.avogadro-ready: Still creating... [30m0s elapsed]
null_resource.avogadro-ready: Still creating... [30m10s elapsed]
null_resource.avogadro-ready: Still creating... [30m20s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Create grafana-agent config volume] **************************************
null_resource.avogadro-ready: Still creating... [30m30s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Render grafana-agent configuration from template] ************************
null_resource.avogadro-ready: Still creating... [30m40s elapsed]
null_resource.avogadro-ready: Still creating... [30m50s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Render grafana-agent-service unit file from template] ********************
null_resource.avogadro-ready: Still creating... [31m0s elapsed]
null_resource.avogadro-ready: Still creating... [31m10s elapsed]
null_resource.avogadro-ready: Still creating... [31m20s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): TASK [Start Grafana Agent service] *********************************************
null_resource.avogadro-ready: Still creating... [31m30s elapsed]
null_resource.avogadro-ready (local-exec): changed: [avogadro]

null_resource.avogadro-ready (local-exec): PLAY RECAP *********************************************************************
null_resource.avogadro-ready (local-exec): avogadro                   : ok=88   changed=71   unreachable=0    failed=0    skipped=0    rescued=0    ignored=0

null_resource.avogadro-ready: Creation complete after 31m37s [id=8389259448168561034]
```

</details>